13/data/attachments/5136bd0b4ebb5d43.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_bcde9c55-436a-4e41-8d8d-46f647aec26f</nif:username>
            <nif:friendToBeAdded>Danielle_thus_Friend_49236_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>